Revit 2027 API
ReferencePlane.Normal Property
 The normal vector of the reference plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Normal { get; }
Public ReadOnly Property Normal As XYZ
	Get
public:
property XYZ^ Normal {
	XYZ^ get ();
}
member Normal : XYZ with get
Property Value
XYZ
See Also
Reference
ReferencePlane Class
Autodesk.Revit.DB Namespace